; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image4 - mode
	image1 - mode
	thermograph0 - mode
	thermograph3 - mode
	thermograph2 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	Star0 - direction
	Star4 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 thermograph3)
	(supports instrument3 image4)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument5 image4)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument6 image1)
	(calibration_target instrument6 Star4)
	(supports instrument7 image4)
	(supports instrument7 thermograph2)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(pointing satellite1 GroundStation2)
	(pointing satellite2 GroundStation3)
	(have_image Phenomenon5 thermograph3)
	(have_image Phenomenon6 image1)
	(have_image Planet7 image1)
))

)

; plan
1. (turn_to satellite2 groundstation3 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 groundstation3)
   goals met: 1 of 6
2. (turn_to satellite0 groundstation3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 6
3. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 2 of 6
4. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 6
5. (calibrate satellite3 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 2 of 6
6. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 2 of 6
7. (turn_to satellite1 phenomenon5 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 6
8. (take_image satellite1 phenomenon5 instrument3 thermograph3)
   added: (have_image phenomenon5 thermograph3)
   goals met: 3 of 6
9. (turn_to satellite1 groundstation2 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation2)
   goals met: 4 of 6
10. (turn_to satellite3 phenomenon6 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon6)
   goals met: 4 of 6
11. (take_image satellite3 phenomenon6 instrument7 image1)
   added: (have_image phenomenon6 image1)
   goals met: 5 of 6
12. (turn_to satellite3 planet7 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 planet7)
   goals met: 5 of 6
13. (take_image satellite3 planet7 instrument7 image1)
   added: (have_image planet7 image1)
   goals met: 6 of 6
